In [2]:
import pandas as pd
import numpy as np
import string 
import random
np.random.seed(56)

In [24]:
pd.DataFrame({"a":[1,2],"b":[3,4],"c":[5,6]}, index=[1,2])

   a  b  c
1  1  3  5
2  2  4  6

In [7]:
pd.DataFrame([[1,2,3],[4,5,6]], index=[1,2], columns=["A","B","C"])

   A  B  C
1  1  2  3
2  4  5  6

In [8]:
pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]], index=[1,2,3,4], columns=["A","B","C","D"])

    A   B   C   D
1   1   2   3   4
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16

In [13]:
pd.Series({"A":"서울","B":"부산","C":"인천"})

A    서울
B    부산
C    인천
dtype: object

In [22]:
pd.DataFrame(np.random.randint(0, 100, size=(2,3)))

    0   1   2
0   8  45  76
1  99  83  92

In [26]:
''.join(random.choice(string.ascii_letters) for i in range(5))

'AfMvR'

In [4]:
def a():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))
print(a())

WIptT

In [47]:
[i for i in range (1,10)]

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [5]:
df = pd.DataFrame(np.random.randint(0,100, size=(10,5)), index=[a() for i in range (1,11)], columns=["국어","영어","수학","사회","과학"])

print(df)

       국어  영어  수학  사회  과학
cenwl  94  25  54  29  10
RJttO  82  65  31  31  51
vZznK  56  56   3  34  32
JRerg  67  48  85  24  16
HbJLK   8  28  80  52  43
zZtDI  58  94  93  54  32
oOXNx  50  95   1  59  37
liPDp  80  27  86   8   2
nprDW  13  23  22  48  83
NJgwE  52  39  50  20   5

In [32]:
df.iloc[[0],:]

       국어  영어  수학  사회  과학
DDhlw  32   0  41  64  46

In [6]:
df.loc[:,'총합'] = df.sum(axis=1)
print(df)

       국어  영어  수학  사회  과학   총합
cenwl  94  25  54  29  10  212
RJttO  82  65  31  31  51  260
vZznK  56  56   3  34  32  181
JRerg  67  48  85  24  16  240
HbJLK   8  28  80  52  43  211
zZtDI  58  94  93  54  32  331
oOXNx  50  95   1  59  37  242
liPDp  80  27  86   8   2  203
nprDW  13  23  22  48  83  189
NJgwE  52  39  50  20   5  166

In [7]:
df.loc['총합'] = df.sum(axis=0)
print(df)

        국어   영어   수학   사회   과학    총합
cenwl   94   25   54   29   10   212
RJttO   82   65   31   31   51   260
vZznK   56   56    3   34   32   181
JRerg   67   48   85   24   16   240
HbJLK    8   28   80   52   43   211
zZtDI   58   94   93   54   32   331
oOXNx   50   95    1   59   37   242
liPDp   80   27   86    8    2   203
nprDW   13   23   22   48   83   189
NJgwE   52   39   50   20    5   166
총합     560  500  505  359  311  2235

SyntaxError: unexpected character after line continuation character (<ipython-input-28-6ee2ec0a06f8>, line 1)